const firWord = [
    '오래된', '값비싼', '빛나는', '귀여운', '부유한', '행복한', '쓸모있는', '재빠른', '깊은', '용감한', '기쁜', '유연한', 
    '부드러운', '정직한', '겸손한', '보통의', '낭만의', '부지런한', '신이난', '건강한', '기발한', '공손한', '튼튼한', 
    '강인한', '배려의', '발랄한', '낙천적인', '꼼꼼한', '침착한', '공평한', '영리한', '숙련된', '온화한', '너그러운', 
    '근면한', '성실한', '야망의', '태평한', '조용한', '상냥한', '체계적인', '즉흥적인', '진실된', '다정한', '유능한', 
    '유쾌한', '세심한', '야심찬', '활발한', '열정적인', '탄탄한', '상상속', '예리한', '똑똑한', '신중한', '진부한', 
    '지적인', '창의적인', '예의바른', '독창적인', '사색에잠긴', '의심많은', '무서운', '깨끗한', '복잡한', '사랑스러운', 
    '걱정하는', '올바른', '질투하는', '깜짝놀란', '실망한', '긴장된', '지루한', '끈적한', '정이많은', '흥미로운', 
    '총명한', '투명한', '게으른', '온순한', '가벼운', '쓸쓸한', '외로운', '매력적인', '길을잃은', '운이좋은', '행운의', 
    '감각적인', '유명한', '단정한', '중요한', '평범한', '자연의', '특수한', '늘기다리는', '관대한', '정중한', '안정된', 
    '대담한', '느긋한', 
];

const secWord = [
    '에스프레소','콜드브루','플랫화이트','모카','라떼','마끼아또','에이드','프라페','아포가토','카푸치노','코코아',
    '오렌지주스','딸기주스','홍차','밀크티','버블티','바닐라라떼','망고주스','아메리카노','블랙커피','고구마라떼',
    '핫초코','민트초코','그린티','아인슈페너','얼그레이','페퍼민트','레몬에이드','자몽에이드','스무디','베이글',
    '젤라또','티라미수','치즈케이크','휘핑크림','밀크쉐이크','그린티라떼','자몽차','생강차','아이스티','달고나라떼',
    '라떼','모카','샤케라또','콘파냐','타로티','우롱차','도피오','치즈폼','마카롱','딸기스무디','카라멜',
    '말차라떼','민트라떼','셔벗','프라푸치노','치즈모카','스파클링','체리콕','체리에이드','파운드','쿠키','초코쿠키',
    '비엔나','헤이즐넛','화이트모카','더치커피','더치라떼','쿠키크림','슈크림','블루레몬','생크림','흑임자','우유',
    '바닐라','말차','뱅쇼','토피넛라떼','소이라떼','쉐이크','복숭아라떼','까눌레','초코머핀','치즈머핀','머핀','초코케이크',
    '브라우니','와플','체리케이크','다쿠아즈','타르트','크로아상','초코식빵','치즈스콘','마들렌','블루베리','허니브레드',
    '핫케이크','뚱카롱','요거트',
]

exports.ranNickname = () => {
    const first = firWord[Math.floor(Math.random() * firWord.length)];
    const second = secWord[Math.floor(Math.random() * secWord.length)];
    return first + second;
}